# Aggregation

In [3]:
import pandas as pd
df = pd.DataFrame([[19, 14, 18, 19],
                   [18, 10, 17, 16],
                   [17, 16, 18, 15]],
                  columns=['OSA',  'JAVA', 
                           'SE', 'DS'])
df

   OSA  JAVA  SE  DS
0   19    14  18  19
1   18    10  17  16
2   17    16  18  15

In [4]:
df.describe()

        OSA       JAVA         SE         DS
count   3.0   3.000000   3.000000   3.000000
mean   18.0  13.333333  17.666667  16.666667
std     1.0   3.055050   0.577350   2.081666
min    17.0  10.000000  17.000000  15.000000
25%    17.5  12.000000  17.500000  15.500000
50%    18.0  14.000000  18.000000  16.000000
75%    18.5  15.000000  18.000000  17.500000
max    19.0  16.000000  18.000000  19.000000

In [18]:
df.sum()

OSA     54
JAVA    40
SE      53
DS      50
dtype: int64

In [7]:
df.max()

OSA     19
JAVA    16
SE      18
DS      19
dtype: int64

In [19]:
df.min()

OSA     17
JAVA    10
SE      17
DS      15
dtype: int64

In [20]:
df.mean()

OSA     18.000000
JAVA    13.333333
SE      17.666667
DS      16.666667
dtype: float64

In [21]:
df.count()

OSA     3
JAVA    3
SE      3
DS      3
dtype: int64

In [8]:
df.agg(['sum', 'min', 'max'])

     OSA  JAVA  SE  DS
sum   54    40  53  50
min   17    10  17  15
max   19    16  18  19

# Groupping

In [9]:
from pandas import DataFrame
df1 = DataFrame(
                [
                    ['Aryan','Singh','Full-time','adminstration',2,20000],
                    ['Rohan','Agarawal','intern','Technical',3,5000],
                    ['Rjya','Shah','Full-time','adminstration',5,10000],
                    ['Yash','Bhatia','Part-time','Technical',7,10000],
                    ['Siddhant','Khanna','Full-time','Management',6,20000],
                ], columns=['First Name','Last name','Type','Department','YoE','Salary']
              )
df1

  First Name Last name       Type     Department  YoE  Salary
0      Aryan     Singh  Full-time  adminstration    2   20000
1      Rohan  Agarawal     intern      Technical    3    5000
2       Rjya      Shah  Full-time  adminstration    5   10000
3       Yash    Bhatia  Part-time      Technical    7   10000
4   Siddhant    Khanna  Full-time     Management    6   20000

In [27]:
df1.groupby(['Type']).sum()

           YoE  Salary
Type
Full-time   13   50000
Part-time    7   10000
intern       3    5000

In [28]:
df1.groupby(['Type']).mean()

                YoE        Salary
Type
Full-time  4.333333  16666.666667
Part-time  7.000000  10000.000000
intern     3.000000   5000.000000

In [14]:
df1.groupby(['Type','Department']).sum()

                         YoE  Salary
Type      Department
Full-time Management       6   20000
          adminstration    7   30000
Part-time Technical        7   10000
intern    Technical        3    5000

In [15]:
df1.groupby(['Department','Type']).sum()

                         YoE  Salary
Department    Type
Management    Full-time    6   20000
Technical     Part-time    7   10000
              intern       3    5000
adminstration Full-time    7   30000